tap "cloudflare/cloudflare"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jorgelbg/tap"
tap "minacle/chntpw"
tap "osx-cross/arm"
tap "osx-cross/avr"

brew "age"
brew "aria2"
brew "arp-scan"
brew "cabextract"
brew "cdrtools"
brew "cfssl"
brew "chezmoi"
brew "cmake"
brew "colima"
brew "cpanminus"
brew "cryptography"
brew "icu4c@76"
brew "python@3.13"
brew "openjdk"
brew "dex2jar"
brew "dfu-util"
brew "e2fsprogs"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "genact"
brew "gh"
brew "ghq"
brew "gnupg"
brew "qt"
brew "gnuplot"
brew "gost"
brew "grpcurl"
brew "iproute2mac"
brew "jadx"
brew "jq"
brew "lazygit"
brew "libfido2"
brew "librsvg"
brew "libusb-compat"
brew "make"
brew "mas"
brew "mise"
brew "mtr"
brew "neovim"
brew "open-ocd"
brew "opensc"
brew "openssh"
brew "peco"
brew "pinentry-mac"
brew "pkgconf"
brew "podman"
brew "pstree"
brew "pygments"
brew "rustscan"
brew "scrcpy"
brew "sdcc"
brew "sevenzip"
brew "sheldon"
brew "starship"
brew "terminalimageviewer"
brew "testdisk"
brew "tmux"
brew "tree"
brew "unzip"
brew "usbutils"
brew "wakeonlan"
brew "watch"
brew "websocat"
brew "wgcf"
brew "wget"
brew "wimlib"
brew "wireguard-go"
brew "wireguard-tools"
brew "xcodes", link: false
brew "xh"
brew "ykman"
brew "yq"
brew "zellij"
brew "cloudflare/cloudflare/curl"
brew "jorgelbg/tap/pinentry-touchid"
brew "minacle/chntpw/chntpw"
brew "osx-cross/avr/avr-gcc@9"
cask "android-commandlinetools"
cask "android-file-transfer"
cask "android-platform-tools"
cask "androidtool"
cask "arc"
cask "balenaetcher"
cask "battery"
cask "claude"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "devpod"
cask "discord"
cask "drawio"
cask "gimp"
cask "git-credential-manager"
cask "google-japanese-ime"
cask "inkscape"
cask "jd-gui"
cask "karabiner-elements"
cask "kicad"
cask "macfuse"
brew "gromgit/fuse/ntfs-3g-mac"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "obsidian"
cask "openmtp"
cask "raspberry-pi-imager"
cask "raycast"
cask "scroll-reverser"
cask "spotify"
cask "stats"
cask "tailscale"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "wezterm"
cask "wireshark"
cask "xcodes"
cask "xquartz"
cask "yubico-yubikey-manager"

mas "Bitwarden", id: 1352778147
