tap "cloudflare/cloudflare"
tap "coder/coder"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jorgelbg/tap"
tap "minacle/chntpw"
tap "olets/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "rcmdnk/file"
tap "surrealdb/tap"
tap "takesako/sigrok"

brew "icu4c@76"
brew "aria2"
brew "arp-scan"
brew "libusb-compat"
brew "cabextract"
brew "cdrtools"
brew "cpanminus"
brew "cryptography"
brew "dex2jar"
brew "dfu-util"
brew "e2fsprogs"
brew "fastfetch"
brew "genact"
brew "gnupg"
brew "qt"
brew "gnuplot"
brew "pkgconf"
brew "gost"
brew "librsvg"
brew "iproute2mac"
brew "jadx"
brew "libfido2"
brew "mas"
brew "mise"
brew "open-ocd"
brew "opensc"
brew "openssh"
brew "pinentry-mac"
brew "pstree"
brew "pygments"
brew "tcl-tk"
brew "python-tk@3.13"
brew "rustscan"
brew "scrcpy"
brew "sdcc"
brew "sevenzip"
brew "terminalimageviewer"
brew "testdisk"
brew "tree"
brew "unzip"
brew "usbutils"
brew "wakeonlan"
brew "watch"
brew "websocat"
brew "wgcf"
brew "wget"
brew "wimlib"
brew "wireguard-go"
brew "wireguard-tools"
brew "xcodes", link: false
brew "ykman"
brew "cloudflare/cloudflare/curl"
brew "coder/coder/coder"
brew "gromgit/fuse/ntfs-3g-mac"
brew "jorgelbg/tap/pinentry-touchid"
brew "minacle/chntpw/chntpw"
brew "osx-cross/avr/avr-gcc@9"

cask "android-commandlinetools"
cask "android-file-transfer"
cask "android-platform-tools"
cask "androidtool"
cask "arc"
cask "balenaetcher"
cask "battery"
cask "claude"
cask "clipy"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "devpod"
cask "discord"
cask "drawio"
cask "firefox"
cask "gimp"
cask "git-credential-manager"
cask "google-japanese-ime"
cask "hashicorp-vagrant"
cask "inkscape"
cask "jd-gui"
cask "karabiner-elements"
cask "kicad"
cask "macfuse"
cask "mactex-no-gui"
cask "menubar-stats"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "moonlight"
cask "obsidian"
cask "openmtp"
cask "playcover-community"
cask "qmk-toolbox"
cask "raspberry-pi-imager"
cask "raycast"
cask "scroll-reverser"
cask "spotify"
cask "stats"
cask "tailscale"
cask "ticktick"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "wezterm"
cask "wireshark"
cask "xcodes"
cask "xquartz"
cask "yubico-yubikey-manager"
cask "zed"
; vscode "bierner.markdown-mermaid"
; vscode "dan-c-underwood.arm"
; vscode "davidanson.vscode-markdownlint"
; vscode "dustypomerleau.rust-syntax"
; vscode "eamodio.gitlens"
; vscode "editorconfig.editorconfig"
; vscode "enkia.tokyo-night"
; vscode "fill-labs.dependi"
; vscode "gamunu.opentofu"
; vscode "github.codespaces"
; vscode "github.copilot"
; vscode "github.copilot-chat"
; vscode "github.vscode-github-actions"
; vscode "golang.go"
; vscode "hashicorp.hcl"
; vscode "hashicorp.terraform"
; vscode "james-yu.latex-workshop"
; vscode "mathiasfrohlich.kotlin"
; vscode "mechatroner.rainbow-csv"
; vscode "mhutchie.git-graph"
; vscode "minecraftcommands.syntax-mcfunction"
; vscode "ms-azuretools.vscode-docker"
; vscode "ms-ceintl.vscode-language-pack-ja"
; vscode "ms-python.debugpy"
; vscode "ms-python.python"
; vscode "ms-python.vscode-pylance"
; vscode "ms-sarifvscode.sarif-viewer"
; vscode "ms-vscode-remote.remote-containers"
; vscode "ms-vscode-remote.remote-ssh"
; vscode "ms-vscode-remote.remote-ssh-edit"
; vscode "ms-vscode.live-server"
; vscode "ms-vscode.makefile-tools"
; vscode "ms-vscode.remote-explorer"
; vscode "ms-vscode.vscode-websearchforcopilot"
; vscode "mxsdev.typescript-explorer"
; vscode "redhat.ansible"
; vscode "redhat.java"
; vscode "redhat.vscode-yaml"
; vscode "richardwillis.vscode-spotless-gradle"
; vscode "ritwickdey.liveserver"
; vscode "rust-lang.rust-analyzer"
; vscode "samuelcolvin.jinjahtml"
; vscode "tamasfe.even-better-toml"
; vscode "torn4dom4n.latex-support"
; vscode "visualstudioexptteam.intellicode-api-usage-examples"
; vscode "visualstudioexptteam.vscodeintellicode"
; vscode "vivaxy.vscode-conventional-commits"
; vscode "vscjava.vscode-gradle"
; vscode "vscjava.vscode-java-debug"
; vscode "vscjava.vscode-java-dependency"
; vscode "vscjava.vscode-java-pack"
; vscode "vscjava.vscode-java-test"
; vscode "vscjava.vscode-maven"
; vscode "vscode-icons-team.vscode-icons"
; vscode "yzhang.markdown-all-in-one"
